; domain
;; source: https://github.com/AI-Planning/pddl-generators/blob/main/blocksworld/domain.pddl
;;
(define (domain blocksworld)

(:requirements :strips)

(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob)) 
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob) 
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=21, out_folder=training/easy, instance_id=72, seed=99

(define (problem blocksworld-72)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 - object)
 (:init 
    (arm-empty)
    (clear b11)
    (on b11 b1)
    (on b1 b15)
    (on b15 b18)
    (on b18 b16)
    (on b16 b4)
    (on b4 b12)
    (on b12 b14)
    (on b14 b10)
    (on b10 b9)
    (on b9 b19)
    (on b19 b5)
    (on b5 b2)
    (on b2 b20)
    (on b20 b3)
    (on-table b3)
    (clear b17)
    (on b17 b8)
    (on b8 b6)
    (on-table b6)
    (clear b7)
    (on b7 b21)
    (on b21 b13)
    (on-table b13))
 (:goal  (and 
    (clear b20)
    (on-table b20)
    (clear b9)
    (on b9 b13)
    (on b13 b21)
    (on b21 b16)
    (on b16 b2)
    (on b2 b5)
    (on b5 b14)
    (on b14 b11)
    (on b11 b4)
    (on b4 b19)
    (on-table b19)
    (clear b6)
    (on b6 b1)
    (on b1 b8)
    (on b8 b10)
    (on b10 b7)
    (on b7 b17)
    (on b17 b15)
    (on-table b15)
    (clear b3)
    (on b3 b18)
    (on b18 b12)
    (on-table b12))))

; plan
1. (unstack b11 b1)
   deleted: (on b11 b1) (clear b11) (arm-empty)
   added: (holding b11) (clear b1)
   goals met: 0 of 25
2. (putdown b11)
   deleted: (holding b11)
   added: (clear b11) (arm-empty) (on-table b11)
   goals met: 0 of 25
3. (unstack b1 b15)
   deleted: (on b1 b15) (clear b1) (arm-empty)
   added: (holding b1) (clear b15)
   goals met: 0 of 25
4. (stack b1 b11)
   deleted: (clear b11) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b11)
   goals met: 0 of 25
5. (unstack b15 b18)
   deleted: (on b15 b18) (clear b15) (arm-empty)
   added: (holding b15) (clear b18)
   goals met: 0 of 25
6. (putdown b15)
   deleted: (holding b15)
   added: (clear b15) (arm-empty) (on-table b15)
   goals met: 1 of 25
7. (unstack b17 b8)
   deleted: (on b17 b8) (clear b17) (arm-empty)
   added: (holding b17) (clear b8)
   goals met: 1 of 25
8. (stack b17 b15)
   deleted: (clear b15) (holding b17)
   added: (arm-empty) (clear b17) (on b17 b15)
   goals met: 2 of 25
9. (unstack b7 b21)
   deleted: (on b7 b21) (clear b7) (arm-empty)
   added: (holding b7) (clear b21)
   goals met: 2 of 25
10. (stack b7 b17)
   deleted: (clear b17) (holding b7)
   added: (arm-empty) (clear b7) (on b7 b17)
   goals met: 3 of 25
11. (unstack b18 b16)
   deleted: (on b18 b16) (clear b18) (arm-empty)
   added: (holding b18) (clear b16)
   goals met: 3 of 25
12. (stack b18 b1)
   deleted: (clear b1) (holding b18)
   added: (arm-empty) (clear b18) (on b18 b1)
   goals met: 3 of 25
13. (unstack b16 b4)
   deleted: (on b16 b4) (clear b16) (arm-empty)
   added: (holding b16) (clear b4)
   goals met: 3 of 25
14. (stack b16 b21)
   deleted: (clear b21) (holding b16)
   added: (arm-empty) (clear b16) (on b16 b21)
   goals met: 3 of 25
15. (unstack b4 b12)
   deleted: (on b4 b12) (clear b4) (arm-empty)
   added: (holding b4) (clear b12)
   goals met: 3 of 25
16. (stack b4 b16)
   deleted: (clear b16) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b16)
   goals met: 3 of 25
17. (unstack b12 b14)
   deleted: (on b12 b14) (clear b12) (arm-empty)
   added: (holding b12) (clear b14)
   goals met: 3 of 25
18. (putdown b12)
   deleted: (holding b12)
   added: (clear b12) (arm-empty) (on-table b12)
   goals met: 4 of 25
19. (unstack b18 b1)
   deleted: (on b18 b1) (clear b18) (arm-empty)
   added: (holding b18) (clear b1)
   goals met: 4 of 25
20. (stack b18 b12)
   deleted: (clear b12) (holding b18)
   added: (arm-empty) (clear b18) (on b18 b12)
   goals met: 5 of 25
21. (unstack b14 b10)
   deleted: (on b14 b10) (clear b14) (arm-empty)
   added: (holding b14) (clear b10)
   goals met: 5 of 25
22. (stack b14 b18)
   deleted: (clear b18) (holding b14)
   added: (arm-empty) (clear b14) (on b14 b18)
   goals met: 5 of 25
23. (unstack b10 b9)
   deleted: (on b10 b9) (clear b10) (arm-empty)
   added: (holding b10) (clear b9)
   goals met: 6 of 25
24. (stack b10 b7)
   deleted: (clear b7) (holding b10)
   added: (arm-empty) (clear b10) (on b10 b7)
   goals met: 7 of 25
25. (unstack b8 b6)
   deleted: (on b8 b6) (clear b8) (arm-empty)
   added: (holding b8) (clear b6)
   goals met: 8 of 25
26. (stack b8 b10)
   deleted: (clear b10) (holding b8)
   added: (arm-empty) (clear b8) (on b8 b10)
   goals met: 9 of 25
27. (unstack b1 b11)
   deleted: (on b1 b11) (clear b1) (arm-empty)
   added: (holding b1) (clear b11)
   goals met: 9 of 25
28. (stack b1 b8)
   deleted: (clear b8) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b8)
   goals met: 10 of 25
29. (pickup b6)
   deleted: (clear b6) (on-table b6) (arm-empty)
   added: (holding b6)
   goals met: 9 of 25
30. (stack b6 b1)
   deleted: (clear b1) (holding b6)
   added: (arm-empty) (clear b6) (on b6 b1)
   goals met: 11 of 25
31. (unstack b9 b19)
   deleted: (on b9 b19) (clear b9) (arm-empty)
   added: (holding b9) (clear b19)
   goals met: 10 of 25
32. (putdown b9)
   deleted: (holding b9)
   added: (clear b9) (arm-empty) (on-table b9)
   goals met: 11 of 25
33. (unstack b19 b5)
   deleted: (on b19 b5) (clear b19) (arm-empty)
   added: (holding b19) (clear b5)
   goals met: 11 of 25
34. (putdown b19)
   deleted: (holding b19)
   added: (clear b19) (arm-empty) (on-table b19)
   goals met: 12 of 25
35. (unstack b4 b16)
   deleted: (on b4 b16) (clear b4) (arm-empty)
   added: (holding b4) (clear b16)
   goals met: 12 of 25
36. (stack b4 b19)
   deleted: (clear b19) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b19)
   goals met: 13 of 25
37. (pickup b11)
   deleted: (clear b11) (on-table b11) (arm-empty)
   added: (holding b11)
   goals met: 13 of 25
38. (stack b11 b4)
   deleted: (clear b4) (holding b11)
   added: (arm-empty) (clear b11) (on b11 b4)
   goals met: 14 of 25
39. (unstack b14 b18)
   deleted: (on b14 b18) (clear b14) (arm-empty)
   added: (holding b14) (clear b18)
   goals met: 14 of 25
40. (stack b14 b11)
   deleted: (clear b11) (holding b14)
   added: (arm-empty) (clear b14) (on b14 b11)
   goals met: 15 of 25
41. (unstack b5 b2)
   deleted: (on b5 b2) (clear b5) (arm-empty)
   added: (holding b5) (clear b2)
   goals met: 15 of 25
42. (stack b5 b14)
   deleted: (clear b14) (holding b5)
   added: (arm-empty) (clear b5) (on b5 b14)
   goals met: 16 of 25
43. (unstack b2 b20)
   deleted: (on b2 b20) (clear b2) (arm-empty)
   added: (holding b2) (clear b20)
   goals met: 17 of 25
44. (stack b2 b5)
   deleted: (clear b5) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b5)
   goals met: 18 of 25
45. (unstack b16 b21)
   deleted: (on b16 b21) (clear b16) (arm-empty)
   added: (holding b16) (clear b21)
   goals met: 18 of 25
46. (stack b16 b2)
   deleted: (clear b2) (holding b16)
   added: (arm-empty) (clear b16) (on b16 b2)
   goals met: 19 of 25
47. (unstack b21 b13)
   deleted: (on b21 b13) (clear b21) (arm-empty)
   added: (holding b21) (clear b13)
   goals met: 19 of 25
48. (stack b21 b16)
   deleted: (clear b16) (holding b21)
   added: (arm-empty) (clear b21) (on b21 b16)
   goals met: 20 of 25
49. (pickup b13)
   deleted: (clear b13) (on-table b13) (arm-empty)
   added: (holding b13)
   goals met: 20 of 25
50. (stack b13 b21)
   deleted: (clear b21) (holding b13)
   added: (arm-empty) (clear b13) (on b13 b21)
   goals met: 21 of 25
51. (unstack b20 b3)
   deleted: (on b20 b3) (clear b20) (arm-empty)
   added: (holding b20) (clear b3)
   goals met: 21 of 25
52. (putdown b20)
   deleted: (holding b20)
   added: (clear b20) (arm-empty) (on-table b20)
   goals met: 23 of 25
53. (pickup b3)
   deleted: (clear b3) (on-table b3) (arm-empty)
   added: (holding b3)
   goals met: 22 of 25
54. (stack b3 b18)
   deleted: (clear b18) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b18)
   goals met: 24 of 25
55. (pickup b9)
   deleted: (clear b9) (on-table b9) (arm-empty)
   added: (holding b9)
   goals met: 23 of 25
56. (stack b9 b13)
   deleted: (clear b13) (holding b9)
   added: (arm-empty) (clear b9) (on b9 b13)
   goals met: 25 of 25
